[
  {
    "q": "What are settings that are used for building the site?",
    "a": "These files are located in. Folder and are:. : contains settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :.",
    "f": "/get-started/",
    "t": 1754448256368
  },
  {
    "q": "What is the title of the download link?",
    "a": "Download link is the title of the download link.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What is the title of the download link 1?",
    "a": "\"Download Link 1\" is the title of the download link.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value for the table head?",
    "a": ": specify if the table is rendered as simple table. If the table contains merged cells, this parameter will not have any influence. Its default value is, but is ignored in the case of detecting merged cells.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "What is the purpose of the documentation site builder guide?",
    "a": "Your comprehensive resource for learning how to create, build, and maintain high-quality documentation sites.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value of the table head?",
    "a": "If the table contains merged cells, this parameter will not have any influence. Its default value is, but is ignored in the case of detecting merged cells.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "What is the title of download link 1?",
    "a": "\"Download Link 1\" is the title of the song \"Download Link 2\".",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What type of content can be imported from a source?",
    "a": "We recommend to use this type of content for short pieces of content that are not very relevant to the core subject of the documentation. This type of content can be imported from any source that returns markdown and follows the same logic of selecting the content between start and end markers. This type of content can be imported only from.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What type of content can be imported from any source?",
    "a": "This type of content can be imported from any source that returns markdown and follows the same logic of selecting the content between start and end markers. This type of content can be imported only from. As we currently do not support custom authentication on client side. Import content from another file from your site, between start and end markers.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What type of content can be imported from external repositories?",
    "a": "It is possible to import content from external public and private github repositories but you must be sure that the content you want to import is available at the time when you build your site.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What is the best way to publish information from figma?",
    "a": "We support design, boards (fig jam), slides and deck files.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "How do you create tables and charts?",
    "a": "Excel is the best tool for creating tables and charts.",
    "f": "/content/content-items/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value of a button?",
    "a": "The default value of a button is link to be targeted when click on the button.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "How can you import content from external repositories?",
    "a": "You can import multiple parts from a source file from you documentation. Each part should be found bewteen a start and end markers.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What is the name of documentation site builder guide?",
    "a": "Welcome to the documentation site builder guide — your comprehensive resource for learning how to create, build, and maintain high-quality documentation sites.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is the answer to a question?",
    "a": "Markdown syntax for text format can be used.",
    "f": "/components/qitem/",
    "t": 1754448256368
  },
  {
    "q": "How can a card be used with aside content?",
    "a": "The card settings can be modified as per your preferences by changing the default values in. File. These are global settings. Changing them will affect all cards used in your documents.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What is the tip of a card with aside content?",
    "a": "Best experience is achieved when using images with transparent background.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value for a chart?",
    "a": "Specify if the chart will be wrapped into a container having a thin border.",
    "f": "/components/xlsx-charts/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value for a border?",
    "a": "Specify if the chart will be wrapped into a container having a thin border.",
    "f": "/components/xlsx-charts/",
    "t": 1754448256368
  },
  {
    "q": "What is the component designed to work with responsive images?",
    "a": "This component allows placing images into your content.",
    "f": "/components/image/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value of a chart?",
    "a": "Specify if the chart will be wrapped into a container having a thin border.",
    "f": "/components/xlsx-charts/",
    "t": 1754448256368
  },
  {
    "q": "What type of content is not indexed for search?",
    "a": "Docaroo allows. To your documents. It is possible to import content from external public and private github repositories but you must be sure that the content you want to import is available at the time when you build your site, as the imported content is added at build time.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "How can you import documents from external repositories?",
    "a": "You can import multiple parts from a source file from you documentation. Each part should be found bewteen a start and end markers.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value of a downloadable file?",
    "a": "The default value of a downloadable file is the text rendered on the link button.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What should not be based on the following text?",
    "a": "Image 1. Image 2. Image 3. Modal title.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value for bootstap buttons?",
    "a": "If type=,.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "How can you create a card gallery from a folder?",
    "a": "The easiest way to create a card gallery is to create it from a folder.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What should be based on the following text?",
    "a": "You should create cards that are meaningful and good looking.",
    "f": "/components/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is the default value of bootstap buttons?",
    "a": "The default value of bootstap buttons is.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "How can tables from excel be imported in docs?",
    "a": "Here is an example of a table without head, having merged cels on rows and columns and having rotated text.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "How to create cards with other docaroo components?",
    "a": "Cards can be included as single items or in galleries of cards. As much as possible avoid using single simple cards.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What is an anchor in the document?",
    "a": "Anchors are placed anywhere in the document.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "How is the gallery rendered on a single row?",
    "a": "Horizontal scroll is enabled.",
    "f": "/components/image/",
    "t": 1754448256368
  },
  {
    "q": "How can you build a complete documentation site from scratch?",
    "a": "Welcome to the documentation site builder guide — your comprehensive resource for learning how to create, build, and maintain high-quality documentation sites for any kind of project, product, or organization.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "How do questions be based on the following text?",
    "a": "Create meaningful and good looking cards.",
    "f": "/components/intro/",
    "t": 1754448256368
  },
  {
    "q": "How are cards rendered on a single row?",
    "a": "Card galleries are always rendered on a single row with horizontal scroll.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can a table from excel be imported?",
    "a": "Tables from Excel can be imported in your docs.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "How can you import multiple parts from a source file?",
    "a": "You can import multiple parts from a source file from you documentation. Each part should be found bewteen a start and end markers. Parts can overlap.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "How can you create a button link?",
    "a": "The button link component generates a button link for downloading files from your documentation site.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What does the download-link component generate?",
    "a": "The download-link component generates a button link.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "What does the download link component generate?",
    "a": "The download-link component generates a button link for downloading files from your documentation site.",
    "f": "/components/download-link/",
    "t": 1754448256368
  },
  {
    "q": "How can you create as many relevant questions as possible?",
    "a": "Import content from other sources into your docs import content.",
    "f": "/content/content-items/",
    "t": 1754448256368
  },
  {
    "q": "What must be strictly based on the following text?",
    "a": "This is a card in a card gallery with one link to external references.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can tables from excel be imported?",
    "a": "Here is an example of a table without head, having merged cels on rows and columns and having rotated text.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "What do you need to follow along with this guide?",
    "a": "Basic familiarity with git and github a working knowledge of markdown.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "Docaroo gives you a series of content items?",
    "a": "Docaroo gives you a series of content items.",
    "f": "/components/intro/",
    "t": 1754448256368
  },
  {
    "q": "How can you create charts in excel?",
    "a": "This component allows importing excel charts into your documents.",
    "f": "/components/xlsx-charts/",
    "t": 1754448256368
  },
  {
    "q": "What is a component designed to work with responsive images?",
    "a": "This component allows placing images into your content.",
    "f": "/components/image/",
    "t": 1754448256368
  },
  {
    "q": "How can you organise documentation?",
    "a": "These beeing said, it becomes clear that it is very important the way in which you organise your documentation. As example, we will use the structure of docaroo documentation.",
    "f": "/content/intro/",
    "t": 1754448256368
  },
  {
    "q": "How do you create as many relevant questions as possible?",
    "a": "Import content from other sources into your docs import content.",
    "f": "/content/content-items/",
    "t": 1754448256368
  },
  {
    "q": "How do you import code from external repositories?",
    "a": "From the main menu, select myinnohub and you will easily find the register option. This will direct you to the registration page where you can input the email address and password. Follow the link provided by the confirmation email and that’s all. Import code from external repositories is exactly as importing any other content (as earlier explained).",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What is a card gallery made of 4 cards?",
    "a": "It works as shown next. The following example build a card gallery made of 4 cards, having different link buttons configuration.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can you create a card gallery?",
    "a": "The easiest way to create a card gallery is to create it from a folder.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What is a component that works with responsive images?",
    "a": "This component allows placing images into your content. Images can have captions. Images can be stored in any place inside the documents root folder.",
    "f": "/components/image/",
    "t": 1754448256368
  },
  {
    "q": "How can alerts contain content introduced in clear?",
    "a": "Alerts can contain content introduced in clear but also can refer from other documents from your documentation or from external public or private repositories.",
    "f": "/components/alerts/",
    "t": 1754448256368
  },
  {
    "q": "What can alerts contain content introduced in clear?",
    "a": "Alerts can contain content introduced in clear but also can refer. From other documents.",
    "f": "/components/alerts/",
    "t": 1754448256368
  },
  {
    "q": "What is the title warning alert?",
    "a": "Aptent taciti sociosqu ad litora torquent per conubia nostra.",
    "f": "/components/alerts/",
    "t": 1754448256368
  },
  {
    "q": "What must not be based or inspired from this prompt?",
    "a": "Image 1. Image 2. Image 3. Modal title.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can fig jam files be opened in figma?",
    "a": "We support design, boards (fig jam), slides and deck files.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "Do not allow enumerations in the question text?",
    "a": "Creating meaningful and good looking cards.",
    "f": "/components/intro/",
    "t": 1754448256368
  },
  {
    "q": "How do you create charts in excel?",
    "a": "This component allows importing excel charts into your documents.",
    "f": "/components/xlsx-charts/",
    "t": 1754448256368
  },
  {
    "q": "What is the title danger alert?",
    "a": "Class aptent taciti sociosqu ad litora torquent per conubia nostra, per subtiltos himenaeos.",
    "f": "/components/alerts/",
    "t": 1754448256368
  },
  {
    "q": "Why not create a table in markdown in excel?",
    "a": "When. Parameter is set to true, the table will be rendered as table.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "How can fig jam file be opened in figma?",
    "a": "This is the best way to publish information from figma since you can maintain your design and boards private.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "What is not accepted by elements/figma.html component?",
    "a": "Elements/figma.html component is not accepted by elements.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "How do you create cards with other docaroo components?",
    "a": "Card supports embedding external content through other docaroo components.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What do you need to know about git?",
    "a": "No prior experience with documentation systems is required.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is the only dynamic ocnfiguration we use inside?",
    "a": "These files are located in. Folder and are:. : contains settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :. : contains specific page settings that are used for building the site and are then sent to the browser to be used on client side :.",
    "f": "/get-started/",
    "t": 1754448256368
  },
  {
    "q": "What does the table above contain merged cells?",
    "a": "It is imported from the same folder as the parent document.",
    "f": "/components/xlsx-tables/",
    "t": 1754448256368
  },
  {
    "q": "How does docaroo support 2 types of text search?",
    "a": "Docaroo supports 2 types of text search:. Native search algolia docs search.",
    "f": "/components/qitem/",
    "t": 1754448256368
  },
  {
    "q": "What does docaroo support 2 types of text search?",
    "a": "Docaroo supports 2 types of text search:. Native search algolia docs.",
    "f": "/components/qitem/",
    "t": 1754448256368
  },
  {
    "q": "How can a document be found?",
    "a": "Put each document on it’s own folder together with the media files.",
    "f": "/content/intro/",
    "t": 1754448256368
  },
  {
    "q": "How do you create a card gallery?",
    "a": "The easiest way to create a card gallery is to create it from a folder.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What type of question must not be based or inspired?",
    "a": "Card galleries are a great way to list elements of the same type (such as projects or categories).",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can a card's card width be altered?",
    "a": "The card settings can be modified as per your preferences by changing the default values in. File. These are global settings. Changing them will affect all cards used in your documents.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "How can a card's card width be changed?",
    "a": "The card settings can be modified as per your preferences by changing the default values in. File.",
    "f": "/components/card/",
    "t": 1754448256368
  },
  {
    "q": "What permissions do visitors grant to embed a figma file?",
    "a": "Post comments which can be viewed and replied to by any other visitor.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "What do docaroo documents contain?",
    "a": "Main tools made available by docaroo for easy work documents and taxonomies.",
    "f": "/content/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is excel?",
    "a": "Excel is a tool for creating tables and charts.",
    "f": "/content/content-items/",
    "t": 1754448256368
  },
  {
    "q": "What is an anchor in an document?",
    "a": "Anchors are placed anywhere in a document.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "What is a basic knowledge of git?",
    "a": "No prior experience with documentation systems is required.",
    "f": "/intro/",
    "t": 1754448256368
  },
  {
    "q": "What does docaroo provide link buttons?",
    "a": "Docaroo provides link buttons in. Style. Check. For more details.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "How do questions be based on a new line?",
    "a": "Import content at run time.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What does importing code from external repositories mean?",
    "a": "The only addition is that you need to wrap the import in markdown code block ticks.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What does innohub support center allow for?",
    "a": "Innohub support center is the single point of contact for notifying us about the issues that you experience when using our services.",
    "f": "/content/ec/",
    "t": 1754448256368
  },
  {
    "q": "What is an anchor inside a document?",
    "a": "Anchors are placed anywhere in a document.",
    "f": "/components/link-button/",
    "t": 1754448256368
  },
  {
    "q": "What does element/figma.html component not accept?",
    "a": "Elements/figma.html component does not accept elements.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "What does docaroo support?",
    "a": "Docaroo supports 2 types of text search:. Native search algolia docs search. Additionally, we provide an advanced search based on different parameters such as the taxonomies.",
    "f": "/components/qitem/",
    "t": 1754448256368
  },
  {
    "q": "What does docaroo document contain?",
    "a": "These beeing said, it becomes clear that it is very important the way in which you organise your documentation. As example, we will use the structure of docaroo documentation. The documents are located in. Folder inside the project folder. We name. As the. Following the structure of docaroo documents, you can organise your documentation based on the next recommendations:. Do not rename, it has to be always named. Do not remove the following sub-folders:. : it contains some mandatory html files (currently 404.html, which you can customise as you need) : it contains the main tools made available by docaroo for easy work documents and taxonomies as well as. Page.",
    "f": "/content/intro/",
    "t": 1754448256368
  },
  {
    "q": "What is not a logical sentence?",
    "a": "Image captions can be added to documents as further shown.",
    "f": "/components/image/",
    "t": 1754448256368
  },
  {
    "q": "What is a title warning alert?",
    "a": "Aptent taciti sociosqu ad litora torquent per conubia nostra.",
    "f": "/components/alerts/",
    "t": 1754448256368
  },
  {
    "q": "What does element/figma.html component accept?",
    "a": "Is not accepted by elements/figma.html component.",
    "f": "/components/rich-media/",
    "t": 1754448256368
  },
  {
    "q": "What does docaroo do?",
    "a": "Gives you a series. Content items to enrich your content.",
    "f": "/components/intro/",
    "t": 1754448256368
  },
  {
    "q": "What does markdown syntax mean?",
    "a": "Markdown syntax means that the content of a faq item is a rich media content.",
    "f": "/components/qitem/",
    "t": 1754448256368
  },
  {
    "q": "What does innohub support center mean?",
    "a": "Innohub support center is the single point of contact for notifying us about the issues that you experience when using our services.",
    "f": "/content/ec/",
    "t": 1754448256368
  }
]