{
    "summaries": [
        {
            "permalink": "/components/alerts/",
            "summary": "Alerts can be of different types as shown by the colors (,,, and ). Alerts can contain content introduced in clear but also can refer. From other documents from your documentation or from external public or private repositories. There is no limit about how many external public repositories you refer."
        },
        {
            "permalink": "/components/intro/",
            "summary": "Documentaroo lets you embed content into your documents using pre-defined components. The components are elements that can be embedded in documents using tags and. As it will be shown for each of the next components."
        },
        {
            "permalink": "/components/qitem/",
            "summary": "The question should always be a text. The answer to the question can be simple text or any rich content that is allowed in markdown. Any docaroo component can be used to render the answer to a question."
        },
        {
            "permalink": "/components/link-button/",
            "summary": "Link buttons helps users to navigate inside your documentation or access external sites. You can add individual link buttons or group link buttons. You can place anchors anywhere in the document and references to them."
        },
        {
            "permalink": "/components/rich-media/",
            "summary": "Use docaroo components to embed rich media into your content. Currently we support design, boards (fig jam), slides and deck files. Prototypes are not supported for the moment."
        },
        {
            "permalink": "/content/intro/",
            "summary": "Learn how to structure and use the content in the most efficient way. Write a concise, factual summary in English with no greetings or instructions, maximum 50 words."
        },
        {
            "permalink": "/content/ec/",
            "summary": "Documentation can be imported from any source that returns markdown. This type of content will be refelcted in the page toc, you can tag (with cutom tags) or classify (custom categories) based on this content."
        },
        {
            "permalink": "/intro/",
            "summary": "Romanian version of the site is on only for demonstrating the multilanguage capabilities of docaroo. Switching to romanian from any other page will show 404 not found page.Write a concise, factual summary in English with no greetings or instructions, maximum 50 words."
        }
    ]
}