{
    "summaries": [
        {
            "permalink": "/components/alerts/",
            "summary": "Learn how to add blocks to your content. You can add both and alerts. Alerts can contain content introduced in clear but also can refer from other documents from your documentation or from external public or private repositories."
        },
        {
            "permalink": "/components/intro/",
            "summary": "Learn how to add different pre-defined and to your content. These are elements that can be embedded in your documents using tags. Pre- defined components represents the most efficient way to create complex and easy to maintain quality content. Content items are helpful liquid tags generating pieces of content."
        },
        {
            "permalink": "/components/qitem/",
            "summary": "The question should always be a text. The answer to the question can be simple text or any rich content that is allowed in markdown. Docaroo suports 2 types of text search: native search and algolia docs search."
        },
        {
            "permalink": "/components/link-button/",
            "summary": "Link buttons helps users to navigate inside your documentation or access external sites. Docaroo provides link buttons in style. You can add individual link buttons or group link buttons. You can place anchors anywhere in the document and references to them."
        },
        {
            "permalink": "/components/rich-media/",
            "summary": "Learn how to use docaroo components to embed rich media into your content. Currently we support design, boards (fig jam), slides and deck files. Prototypes are not supported for the moment, we are working on this."
        },
        {
            "permalink": "/content/intro/",
            "summary": "Learn how to structure and use the content in the most efficient way. The secret is to use to the maximum extent the features made available. Importing external content (at build time or at run time) is the most powerful."
        },
        {
            "permalink": "/content/ec/",
            "summary": "Docaroo allows to your documents. External content is important because it allows you to create of content and import these parts in multiple places. It is possible to import content from external public and private GitHub repositories."
        },
        {
            "permalink": "/intro/",
            "summary": "Documentation site builder guide for any kind of project, product, or organization. Walk you through everything you need to know about building a complete, maintainable, and professional documentation site from scratch."
        },
        {
            "permalink": "/get-started/",
            "summary": "Getting started with docaroo requires, first of all, to design your documentation. Organising well your documentation (or blog) is crucial. This will involve defining the folder structure and also the taxonomies. Docaroo can take care of automatically generating other information about you documentation."
        },
        {
            "permalink": "/components/scrollspy/",
            "summary": "Scroll spies are great ways of organising information inside your documents. We made them flexible and easy to be included in the documents. Any docaroo component, including importing esternal content or rich content ones, can be used to populate scroll spies and tabs."
        },
        {
            "permalink": "/components/content-items/",
            "summary": "Docaroo makes available a series of content items that can be used to enrich your documents and to be very efficient when wanting to incorporate piecers of content in a fast and robust way."
        },
        {
            "permalink": "/components/downloads/",
            "summary": ""
        },
        {
            "permalink": "/components/download-link/",
            "summary": "Download-link component generates a button link for downloading files from your documentation site. Only downloading from your site is allowed, for security reasons it is not allowed to create download links targeting files hosted on external sites."
        },
        {
            "permalink": "/components/xlsx-tables/",
            "summary": "This component allows users to create tables in markdown and load them in excel. It offers two types of tables: fully featured and without some features."
        },
        {
            "permalink": "/components/xlsx-charts/",
            "summary": "This component allows importing excel charts into your documents. Combined with component, this one provides the full support to share structured data in a professional way. Currently we support only: line charts column and bar charts pie and doughnut charts we do not support importing the colors you assign to."
        },
        {
            "permalink": "/components/image/",
            "summary": "This component allows placing images into your content. Images can have captions (lets say you need to show some credits or copyright information) or not. The component is designed to work with responsive images."
        },
        {
            "permalink": "/content/content-items/",
            "summary": "Docaroo makes available a series of content items that can be used to enrich your documents and to be very efficient when wanting to incorporate pieces of content in a fast and robust way."
        },
        {
            "permalink": "/components/card/",
            "summary": "Cards can be included as single items or in galleries of cards."
        },
        {
            "permalink": "/experiments/intro/",
            "summary": "We are working on a series of interesting features that will make your life much easier when creating content. We consider those features as experiments. You are encouraged to use them and to send us your feedback."
        },
        {
            "permalink": "/experiments/pdf-summary/",
            "summary": "This component helps enhancing your content with auto generated summaries from pdf files. It is combined with the download component, so the output rendered will be a summary of the pdf file and a download button."
        },
        {
            "permalink": "/experiments/docx-summary/",
            "summary": "This component helps enhancing your content with auto generated summaries from docx files. It is combined with the download component, so the output rendered will be a summary of the docx file and a download button."
        },
        {
            "permalink": "/get-started/doc-contents/",
            "summary": "Doc-contents is the root folder of the documents and collections. The way in which this folder is organised is strictly depending on the structure you want to have for your documentation. Some sub-folders are necessary to be present: the collection folder where the qa files must be placed if a."
        },
        {
            "permalink": "/get-started/site-config/",
            "summary": "Docaroo provide multiple options to configure the the site functionality and appearence. Each time when a configuration is changed, it is necessary to re-build the site to make the configuration effective."
        },
        {
            "permalink": "/get-started/config-files/",
            "summary": "Docaroo provide multiple options to configure the the site functionality and appearence. Each time when a configuration is changed, it is necessary to re-build the site to make the configuration effective. Docaroo configurations are of two categories: necessary at build time necessary at run time."
        },
        {
            "permalink": "/get-started/config-options/",
            "summary": "All the options available for site appearance and functionalities are shown in the next table. These options are available in _config.yml or in the configuration files and will allow personalisation of the documentation site. Note the site must be built and deployed (where applicable) in order to make new config."
        },
        {
            "permalink": "/get-started/env/",
            "summary": "Environment variables are used only at build time. At run time (in dev or production environments) the environment variables are not used anymore. They are mostly used to store values that should never be exposed, such as access keys and tokens that are used to integrate some external features and."
        },
        {
            "permalink": "/integrate/",
            "summary": "Docaroo provides out-of-the-box a series of integrations. The main purpose is to enhance the functionalities of the site. Each integration can be independently enabled and configured or disabled."
        },
        {
            "permalink": "/integrations/ga-gtm/",
            "summary": "Google analytics and google tag manager are installed by default if enabled and configured in _databuildconfig.yml. This will enable the collection of data about the site. When ga and gtm are connected, ga collects the information available when a gtm tag fires. However, the most important feature of the integration."
        },
        {
            "permalink": "/integrations/algolia/",
            "summary": "Docaroo provides out-of-the-box full integration with algolia docsearch. The search experience has multilanguage support by default. The ui experience is provided by default once this integration is enabled and properly configured."
        },
        {
            "permalink": "/integrations/github/",
            "summary": "Docaroo integration allows you to import content from public and private repositories. For the private repositories, content can be imported only from the repositories within the scope of the personal access token that must be configured. At the moment, we do not support importing content from private repositories at run."
        },
        {
            "permalink": "/integrations/hubspot/",
            "summary": "Hubspot tracking code is installed by default if hubspot integration is enabled in . This will enable the features that are related to the tracking code such as monitoring the visits on the site. The feedback form can be located on the right-bottom corner of each page."
        },
        {
            "permalink": "/integrations/new-relic/",
            "summary": "New relic integration is provided out-of-the-box once this integration is enabled. This integration allows monitoring and measuring the perfomance of the site. Used in combination with the extension capabilities, it provides a robust way to log the user interactions with site."
        }
    ]
}