{
    "summaries": [
        {
            "permalink": "/components/alerts/",
            "summary": "Alerts can be of different types as shown by the colors (,,, and ). Alerts can contain content introduced in clear but also can refer. From other documents from your documentation or from external public or private repositories. There is no limit about how many external public repositories you refer."
        },
        {
            "permalink": "/components/intro/",
            "summary": "Learn how to add different pre-defined. Content items to your content. These are elements that can be embedded in your documents using. As it will be shown for each of the next components."
        },
        {
            "permalink": "/components/qitem/",
            "summary": "The question should always be a text. The answer to the question can be simple text or any rich content that is allowed in markdown. Docaroo suports 2 types of text search."
        },
        {
            "permalink": "/components/link-button/",
            "summary": "Link buttons helps users to navigate inside your documentation or access external sites. Docaroo provides link buttons in style. You can add individual link buttons or group link buttons."
        },
        {
            "permalink": "/components/rich-media/",
            "summary": "Use docaroo components to embed rich media into your content. Currently we support design, boards (fig jam), slides and deck files. Prototypes are not supported for the moment."
        },
        {
            "permalink": "/content/intro/",
            "summary": "There are two types of content that you can use in your documents:. Content directly included in your document or content imported from. External sources are very important because allows you to create reusable pieces of content."
        },
        {
            "permalink": "/content/ec/",
            "summary": "Documentaroo allows you to create. Of content and import these parts in multiple places in your documents. It is possible to import content from external public and private repositories. You must be sure that the content you want to import is available at the time when you build your site."
        },
        {
            "permalink": "/intro/",
            "summary": "Documentation site builder guide is a comprehensive resource for learning how to create, build, and maintain high-quality documentation sites. This guide will walk you through everything you need to know about building a complete, maintainable, and professional documentation site."
        },
        {
            "permalink": "/get-started/",
            "summary": "Getting started with docaroo requires, first of all, to design your documentation. Organising well your documentation (or blog) is crucial. This will involve defining the folder structure and also the taxonomies. Docaroo can take care of automatically generating other information about you documentation."
        },
        {
            "permalink": "/components/scrollspy/",
            "summary": "Scroll spies are great ways of organising information inside your documents. We made them flexible and easy to be included in the documents. Any docaroo component, including importing esternal content or rich content ones, can be used to populate scroll spies and tabs."
        },
        {
            "permalink": "/components/content-items/",
            "summary": "Docaroo makes available a series of content items that can be used to enrich your documents and to be very efficient when wanting to incorporate piecers of content in a fast and robust way."
        },
        {
            "permalink": "/components/downloads/",
            "summary": ""
        },
        {
            "permalink": "/components/download-link/",
            "summary": "The download-link component generates a button link for downloading files from your documentation site. Only downloading from your site is allowed, for security reasons it is not allowed to create download links targeting files hosted on external sites."
        },
        {
            "permalink": "/components/xlsx-tables/",
            "summary": "Tables can be imported directly from excel. When a table contains merged cells, it will be rendered as table, regardless of the value of the."
        },
        {
            "permalink": "/components/xlsx-charts/",
            "summary": "This component allows importing excel charts into your documents. Currently we support only:. Line charts column and bar charts pie and doughnut charts. We do not support importing the colors you assign to the series in the excel chart."
        },
        {
            "permalink": "/components/image/",
            "summary": "Write a concise, factual summary in English with no greetings or instructions, maximum 50 words, for the following text. This component allows placing images into your content. Images can have captions (lets say you need to show some credits or copyright information) or not."
        },
        {
            "permalink": "/content/content-items/",
            "summary": "Docaroo makes available a series of content items that can be used to enrich your documents and to be very efficient when wanting to incorporate piecers of content in a fast and robust way."
        },
        {
            "permalink": "/components/card/",
            "summary": "Cards can be included as single items or in galleries of cards."
        }
    ]
}