{
    "summaries": [
        {
            "permalink": "/components/alerts/",
            "summary": "You can add alerts to your page by clicking on the 'Add alerts' button in the top right corner of your page or by clicking on the 'Add alerts' link in the upper right corner of your page."
        },
        {
            "permalink": "/components/intro/",
            "summary": "Docaroo is a free online tool that allows you to create, edit and publish high-quality annotated bibliography and other annotated bibliography content on the web."
        },
        {
            "permalink": "/components/qitem/",
            "summary": "How much do you know about the history of the English Defence League (EDL) and its predecessor, the English Defence League (EDL)?"
        },
        {
            "permalink": "/components/link-button/",
            "summary": "How to add link buttons to your documentation: how to use docaroo to add link buttons to your documentation: how to use docaroo to add link buttons to your documentation:."
        },
        {
            "permalink": "/components/rich-media/",
            "summary": "How to use docaroo components to embed rich media into your content - learn how to use docaroo components to embed rich media into your content - how to use docaroo components to embed rich media into your content."
        },
        {
            "permalink": "/content/intro/",
            "summary": "In this lesson, we are going to look at how to structure and use the content in your documentation to the best of your ability and to the best of your knowledge."
        },
        {
            "permalink": "/content/ec/",
            "summary": "Docaroo allows you to create and import external content into your documents, but you must be sure that the content you want to import is available at build time, as the imported content is added at build time."
        },
        {
            "permalink": "/collection-2/Z/z/",
            "summary": "BBC Sport asks you to help shape the debate on the future of BBC Sport by writing a short summary of your views on the sport, and then voting for your favourite."
        },
        {
            "permalink": "/intro/",
            "summary": "Docaroo is a multi-language documentation platform that allows developers to create, publish, and manage high-quality documentation in a variety of languages."
        }
    ]
}